print('''
თამაში:

თამაში: ჩაფიქრებული რიცხვის გამოცნობა
თამაშში რეალიზებულია შემდეგი ლოგიკა:

კომპიუტერი "ჩაიფიქრებს" ნებისმიერ მთელ რიცხვს 0-დან 100-ს ფარგლებში
ინტერაქტიულ რეჟიმში მოთამაშეს ეძლევა მთელი რიცხვის შეტანის საშუალება
მთელი რიცხვების შეტანით მოთამაშე ცდილობს გამოიცნოს კომპიუტერის "ჩაფიქრებული" რიცხვი
თუ მოთამაშემ არ შეიყვანა ციფრი სწორად (მაგ. შეიყვანა სიმბოლო), პროგრამა დაწერს: "გთხოვთ შეიყვანოთ ციფრი"
თუ მოთამაშემ შეიყვანა ციფრი რომელიც ნაკლებია "ჩაფიქრებულზე", მაშინ დაიწერება მინიშნება: "თქვენი რიცხვი ნაკლებია ჩაფიქრებულ რიცხვზე"
თუ მოთამაშემ შეიყვანა ციფრი რომელიც მეტია "ჩაფიქრებულზე", მაშინ დაიწერება მინიშნება: "თქვენი რიცხვი მეტია ჩაფიქრებულ რიცხვზე"
თუ მოთამაშემ გამოიცნო ჩაფიქრებული რიცხვი, მაშინ პროგრამა მიულოცავს მას და დაასრულებს მუშაობას
თუ მუთამაშემ გადაწყვიტა თამაშის დასრულებამდე გამოსვლა პროგრამიდან, მაშინ წერს სიტყვას: "exit" ან უბრალოდ არაფერი არ შეყავს ციფრის შეყვანის ველში და აჭერს "enter"-ს.
თამაშის არსი: ვინც უფრო ნაკლებ ცდაში გამოიცნობს კომპიუტერის "ჩაფიქრებულ" რიცხვს ის სუპერმენია :)

''')
import random  # შემთხვევითი რიცხვების გენერატორი ბიბლიოთეკის ჩართვა

number = random.randint(0, 100)  # შემთხვევითი მთელი რიცხვის დაგენერირება 0-დან 100-ს ფარგლებში

while True:  # მუდმივი, ავტომატური ციკლის ორგანიზება, სანამ ჩვენ არ გავაჩერებთ მას
    answer = input("Guess the number: ")

    if answer == "" or answer == "exit":  # პროგრამიდან გამოსვლისთვის: "exit" ან უბრალოდ "enter"
        print("Bye bye!")
        break  # პროგრამის მუშაობის შეწყვეტა

    if not answer.isdigit():  # ვამოწმებთ, შეყვანილ იქნა თუ არა რიცხვი
        print("Please input digit!")
        continue  # თუ რიცხვი არ იყო შეყვანილი, თავიდან მოთხოვნა რიცხვის შეყვანის

    answer = int(answer)  # შეტანილი მნიშვნელობის integer ტიპად გადაყვანა

    if answer == number:  # სრულდება როდესაც გამოვიცანით ჩაფიქრებული რიცხვი
        print('Congratulations!')
        break  # პროგრამის მუშაობის შეწყვეტა
    elif answer < number:  # სრულდება როდესაც ჩვენი რიცხვი ჩაფიქრებულზე ნაკლებია
        print('Your number is LOW')
    else:  # სრულდება როდესაც ჩვენი რიცხვი ჩაფიქრებულზე მეტია
        print('Your number is HIGH')
